[
    {
        "Neighborhood": "N/A",
        "Address": "135 Montgomery Ave, Scarsdale, NY 10583",
        "Postal Code": "10583",
        "Price": "$425000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "1265 sqft",
        "Lot Size": "4792 sqft",
        "Image": "https://ap.rdcpix.com/e54e30ea3c0b8fc7e5506783fdb1f04cl-m3267675659s.jpg",
        "Description": "Condo Living in Westchester! This spectacular unit is a spacious 2 bed/1 bath updated condo with plenty of storage and parking. Close to all! Short walk to Metro North Train and 32 minutes to NYC. Eastchester Schools. Walk to restaurants, shops, playground and multi-use fields/ green space. Monthly maintenance includes water, sewar, trash, maintenance of common areas, and snow removal. Membership to Lake Isle Pool, Tennis, Golf is available as an Eastchester resident."
    },
    {
        "Neighborhood": "N/A",
        "Address": "105 Garth 1 Rd Unit 6F and 2, Scarsdale, NY 10583",
        "Postal Code": "10583",
        "Price": "$799000",
        "Bedrooms": 3,
        "Bathrooms": 3,
        "House Size": "1613 sqft",
        "Lot Size": "None sqft",
        "Image": "https://ap.rdcpix.com/e26be01c21b3ea6a318f36eded3a91acl-b829157863s.jpg",
        "Description": "Step into effortless elegance in this beautifully renovated and generously sized 3-bedroom, 3- full bath co-op, perfectly situated on sought-after Garth Road. With a house-like feel and none of the upkeep worries, this unit offers the comfort of space and the ease of low-maintenance livingall wrapped in tasteful luxury. Meticulously maintained grounds, serene outdoor seating area, an on call live in super, just steps away from Scarsdale Metro North, a 30 minute train ride to the city, bus stop right in front of building, security system, and an array or eateries, gym and shops, near Lake Isle Country Club with fabulous tennis and pool facilities, numerous private parking options all within a block, this is modern convenience at it's finest. Featuring beautiful hardwood floors throughout, this home boasts a stunning mudroom with abundant storage, a walk in stylish pantry accented by a single French door and exquisite mosaic tile flooring, spacious linen closet and walk-in closets complete with built-insstorage is anything but scarce here. Indulge in the luxury of three fully renovated bathrooms, each showcasing its own distinct style and charm. The primary suite bath is a true standout, featuring an elegant herringbone tile design that brings spa-like tranquility right into your daily routine The expansive living room with dining area flows seamlessly into your very own brand new luxurious kitchen, thoughtfully designed with ample cabinetry, sleek stainless steel appliances, built-in wine storage, and a stunning 8-foot quartz waterfall edge islandperfect for effortless entertaining the holidays or get-togethers with friends. Updated plumbing, updated electric and Sonos surround sound system are just a few more upgrades...too many upgrades to list. A perfect haven for those seeking tranquility, stress free living without compromising on convenience. Come take a look for yourself and make this your new home!"
    },
    {
        "Neighborhood": "N/A",
        "Address": "56 Morris Ln S, Scarsdale, NY 10583",
        "Postal Code": "10583",
        "Price": "$1499999",
        "Bedrooms": "N/A",
        "Bathrooms": "N/A",
        "House Size": "N/A sqft",
        "Lot Size": "N/A sqft",
        "Image": "https://ap.rdcpix.com/585b3b49d706abfb47524583d74b5945l-b891698012s.jpg",
        "Description": "No description available."
    },
    {
        "Neighborhood": "Fox Meadow",
        "Address": "27 Olmsted Rd, Scarsdale, NY 10583",
        "Postal Code": "10583",
        "Price": "$4300000",
        "Bedrooms": 6,
        "Bathrooms": 8,
        "House Size": "6690 sqft",
        "Lot Size": "22651 sqft",
        "Image": "https://ap.rdcpix.com/fa2ce9810e4972a947e236cc8909f12el-m2129767980s.jpg",
        "Description": "Experience timeless elegance and modern luxury in this magnificent Scarsdale Colonial home, perfectly situated in the heart of Fox Meadow. Built in 2002 by renowned architects Allisberg Parker, this exceptional residence offers over 6, 500 square feet of thoughtfully designed space, blending classic architectural details with the comforts of contemporary living. Boasting six bedrooms, six full bathrooms, and two half bathrooms, this home provides ample space for family and guests. Upon entering, you're welcomed by a grand two story entrance hall adorned with herringbone hardwood floors, leading to a formal living room with a full fireplace, a sophisticated dining room with French doors opening to the covered patio and lush backyard. The St. Charles-designed chefs kitchen features high-end appliances and a sun-filled breakfast room with seating for 8ideal for both casual mornings and festive gatherings. Just steps away, an oversized family room invites relaxation, with direct access to the deck and the stunning 20x40 Shoreline pool and spa, complete with an automatic cover for year-round enjoyment and safety and an outdoor changing room. A sunroom and powder room are next to the family room, as well as a handsome home office with its own full bathoffering flexibility for remote work or guests. Upstairs, the master suite is a private retreat, featuring a second office, a spacious bedroom with two walk-in closets, and a spa-like master bath. A guest suite with a sunny bay window and en-suite bath adds charm, while a separate children's wing offers three large bedrooms, two additional baths, and a convenient laundry room. The expansive lower level provides even more living space, including a recreation room, an au pair room with a full bath, a second laundry room, and a three-car garage. Additional amenities include a media room, natural gas-powered generator, two hot water heaters, and a central sound system. Beyond the homes luxurious interior, the private fenced-in yard creates a serene outdoor oasisperfect for entertaining or tranquil relaxation. This exceptional property is ideally located in the heart of Fox Meadow and is considered the trifecta: Walking distance to Fox Meadow Elementary School and the High School, with free bus service to Scarsdale Middle School. It is also equidistant to the Scarsdale and Hartsdale villages and train stations. Discover the perfect blend of beauty and modern convenience and experience all that this extraordinary home has to offer!"
    },
    {
        "Neighborhood": "N/A",
        "Address": "123 Randolph Rd, White Plains, NY 10607",
        "Postal Code": "10607",
        "Price": "$660000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1808 sqft",
        "Lot Size": "7405 sqft",
        "Image": "https://ap.rdcpix.com/4fed6a9fbfc9cb335480913147d70c2bl-m2227097200s.jpg",
        "Description": "Final offers are due to the listing agent by 12 p.m. on Thursday, June 12. Welcome to 123 Randolph Roada picture-perfect Cape Cod tucked away on a peaceful cul-de-sac in one of White Plains most desirable residential pockets. This 3-bedroom, 2-bath home offers over 1, 800 square feet of inviting living space, thoughtfully designed for everyday comfort and effortless entertaining. Inside, the homes classic layout provides flexibility and warmth. Those seeking one-level living will appreciate the first floors two bedrooms and full bath. Upstairs, the primary bedroom with oversized en-suite bath offers a quiet retreat with fouryes, fourclosets. The second floors sunken den, featuring a skylight and vaulted ceiling, offers additional flexibility and makes an ideal family room, enviable home office, or extra sleeping area. A highlight of the home is the expansive rear deck, seamlessly accessed through sliding glass doors that bathe the kitchen in natural light and create a true indoor-outdoor connection. Step outside to enjoy morning coffee or summer gatherings overlooking a private, fenced yard framed by lush landscaping and seasonal blooms. The large unfinished basement is a blank canvas that presents a valuable opportunity to expandperfect for a home gym, playroom, workshop, art studio, or additional living space tailored to your needs. Ideally located just minutes from downtown White Plains, the Metro-North station, parks, schools, and shopping, 123 Randolph Road offers a rare blend of peace, privacy, and convenienceall nestled in a storybook neighborhood setting. Listed property taxes are comprised of 2025 town & county and 2024 school taxes. Basic STAR savings is $1, 112.75 and Enhanced is $2, 776 for those who qualify. Contact listing agent for questions about 123 Randolph, STAR program, or to schedule a private tour."
    },
    {
        "Neighborhood": "West Harrison",
        "Address": "63 Buckout Rd, West Harrison, NY 10604",
        "Postal Code": "10604",
        "Price": "$3225000",
        "Bedrooms": 6,
        "Bathrooms": 7,
        "House Size": "6520 sqft",
        "Lot Size": "43560 sqft",
        "Image": "https://ap.rdcpix.com/dfa654659d24ec756c194d73af7f9992l-m260203303s.jpg",
        "Description": "Set on a sprawling one-acre private lot, surrounded by Silver Lake Preserve, this beautifully crafted new home blends luxury and elegance in every detail. With over 6, 500 sq ft (including basement) of living space and an open floor plan, its designed for both comfort and style. The main level features 9-foot ceilings with crown molding, a spacious living room, formal dining with Butlers pantry, and custom cabinetry. The inviting family room with a fireplace opens to a gourmet eat-in kitchen with high-end finishes and appliances. Step onto the deck off the kitchen to take in the serene backyard viewsideal for relaxing or entertaining. Upstairs, the primary bedroom suite is a private retreat with two walk-in closets and a spa-like bathroom. Four additional bedrooms, three full baths, and a laundry room complete the upper level. The finished, walk-out lower level offers a private guest suite with a full bath, a large recreation area, and generous storage, which can accommodate a future wine cellar. A three-car garage connects to a mudroom with a half bath, offering convenient access to the kitchen. Ideally located just minutes from downtown White Plains and both White Plains and North White Plains train stations, this home combines tranquility with accessibility."
    },
    {
        "Neighborhood": "Battle Hill",
        "Address": "505 Central Ave Apt 618, White Plains, NY 10606",
        "Postal Code": "10606",
        "Price": "$239000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "1000 sqft",
        "Lot Size": "None sqft",
        "Image": "https://ap.rdcpix.com/c6d36ef71923c083de73dfd57a3a692el-m301015902s.jpg",
        "Description": "Beautifully maintained 2 bedroom/1 bath unit located at the heart of Central Avenue. Updated kitchen with stainless appliances, updated bath with granite vanity, hardwood floors in living room / dining room , carpet in foyer and bedrooms, freshly painted living room/dining room with door to balcony, oversized master bedroom with tons of custom storage and a 2nd door to large balcony. This outdoor sanctuary offers lovely rear facing wooded views & privacy galore. Unit includes parking spot #200. Newly renovated lobby and outside courtyard. ADA accessible building, 2 Elevators, storage room, bike room, new laundry on every floor, On Site Super. Maintenance includes heat, hot water, taxes, snow removal, common areas, and does not reflect the star reduction of $123 mth. Close to train, buses to NYC (on corner), schools, parks, shopping..."
    },
    {
        "Neighborhood": "Prospect Park",
        "Address": "38 Winslow Rd, White Plains, NY 10606",
        "Postal Code": "10606",
        "Price": "$799999",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "1438 sqft",
        "Lot Size": "10454 sqft",
        "Image": "https://ap.rdcpix.com/75c8fd7ad03d210706b6bc87b83cf09cl-w2095644020s.jpg",
        "Description": "Nestled in the desirable Prospect Park neighborhood of White Plains, this bright and welcoming home offers charm, space, and exciting potential. A classic front porch and attractive curb appeal invite you in, setting the tone for a property full of opportunity. The sun-filled living room features a fireplace and oversized windows. The eat-in kitchen includes granite countertops, stainless steel appliances, and a cheerful solarium with views of the private, fenced-in backyard. Also on the main floor is a versatile home office or fourth bedroom, along with a full bathroom. Throughout the home, you'll find hardwood floors and recessed lighting. Upstairs are three generously sized bedrooms and a renovated full bathroom. The partially-finished basement provides additional living space, laundry, and abundant storage.  This home is a great opportunity to customize and make your own in one of White PlainsÂ\u0092 most beloved neighborhoodsÂ\u0097just minutes from shopping, restaurants, and major transportation. A detached two-car garage adds to the convenience."
    },
    {
        "Neighborhood": "N/A",
        "Address": "8 Carriage Ln, Chappaqua, NY 10514",
        "Postal Code": "10514",
        "Price": "$1699000",
        "Bedrooms": 2,
        "Bathrooms": 4,
        "House Size": "3269 sqft",
        "Lot Size": "None sqft",
        "Image": "https://nh.rdcpix.com/28ce6f6394faf589d9beef1cb06ff4f4l-f563872546s.jpg",
        "Description": "As you enter the Greeley Newhaven, the exquisite foyer presents sweeping views of this home's open-concept floor plan and luxurious finishes. The spacious kitchen and great room provide the ideal space for entertaining. The casual dining area provides the perfect space for entertaining guests with easy access to the kitchen. The two-story great room is the perfect setting for relaxation with its cozy fireplace and ample natural light. The first-floor primary bedroom suite features a lavish bathroom and a huge walk-in closet. The secondary bedroom includes a shared hall bath. The versatile loft can be suited to fit your lifestyle. MLS Number: 846483 Disclaimer: Photos are images only and should not be relied upon to confirm applicable features."
    },
    {
        "Neighborhood": "N/A",
        "Address": "341 Millwood Rd, Chappaqua, NY 10514",
        "Postal Code": "10514",
        "Price": "$899000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2541 sqft",
        "Lot Size": "84071 sqft",
        "Image": "https://ap.rdcpix.com/99bc13ec299516b568035932fea81927l-b3240955241s.jpg",
        "Description": "Nestled on nearly 2 acres of serene, wooded land, this beautifully maintained 4-bedroom, 2.5-bath home offers space, comfort, and privacy. The bright and airy eat-in kitchen features abundant cabinet space, a convenient in-kitchen laundry, and a large picture window overlooking the scenic backyard. A sun-filled living room with an oversized picture window enhances the home's warm and inviting atmosphere. The generously sized bedrooms provide ample space for relaxation, while the renovated lower level boasts all-tile flooring, a cozy wood-burning fireplace in the family room, an additional bedroom, a powder room, and plenty of storage. Enjoy outdoor living on the spacious deck, perfect for entertaining or unwinding while taking in the tranquil surroundings. The upper level of the private yard offers even more space, perfect for a fire pit or additional outdoor activities. Additional highlights include a full-house generator for year-round peace of mind, freshly painted interior, and hardwood floors under the carpeting. A perfect blend of space, functionality, and charm, this home is ready to welcome its next owners!"
    },
    {
        "Neighborhood": "N/A",
        "Address": "50 Overlook Dr, Chappaqua, NY 10514",
        "Postal Code": "10514",
        "Price": "$2225000",
        "Bedrooms": 6,
        "Bathrooms": 6,
        "House Size": "5234 sqft",
        "Lot Size": "52272 sqft",
        "Image": "https://ap.rdcpix.com/dfd0648420cafd47065f715e1c389d45l-m2323055195s.jpg",
        "Description": "50 Overlook Drive, an elegant 6-bedroom colonial Tudor set in a quiet, tree-lined neighborhood. With fresh upgrades completed this month, including interior repainting, carpet-removal to expose wood floors. This one-of-a-kind home is a must see. Meticulously maintained heating and cooling systems, brick exterior, and a classic-tile roof are some of the exceptional features this home can offer. Homes built to this quality are a rare find. Constructed in 1929, the home is also graced with soaring ceilings, intricate period moldings, and expansive sunlit interiors. Designed for both grand entertaining and comfortable living, this spacious home is roaring with charm and can suit a variety of tastes and living styles. The first floor offers a living room with fireplace, an all seasons sunroom, a bright and airy dining room, a kitchen with pantry and wet-bar, a half bath, and an in-law or au pair suite with a full bath. Upstairs features 5 bedrooms and 3 full baths, a grand hallway, and attic access. Additional recreational space is provided in the finished basement, with a family room, a gym, and large mudroom, a half-bath, and a utility room. The beautifully landscaped 1.2-acre lot boasts stunning specimen plantings and a private stone patio adjacent to the all-seasons sunroom. There is also a charming bridge, designed by renowned architect Ned Baldwin, leading to a park-like setting in the backyard. This is an incredible opportunity to own a truly distinguished home in one of Chappaquas most desirable neighborhoods. Experience the perfect balance of classic architecture and modern luxury in this extraordinary residence, in a home that is built to stand the test of time."
    },
    {
        "Neighborhood": "N/A",
        "Address": "200 Millwood Rd, Chappaqua, NY 10514",
        "Postal Code": "10514",
        "Price": "$1799999",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "3009 sqft",
        "Lot Size": "130680 sqft",
        "Image": "https://ap.rdcpix.com/c617d7f46b2c2de0d2978cbaae4d6907l-m3693545135s.jpg",
        "Description": "Tucked away in a 3+ acre private storybook setting, this reimagined farmhouse blends timeless charm with modern comfort. Set back from the road on a scenic, private property with gorgeous mature landscaping, two tranquil ponds, and wide-open views, this 4-bedroom home is a peaceful retreat unlike any other. Inside, the open, sunlit layout features oversized windows that invite the outdoors in, and wide-plank hardwood floors that bring warmth to every room. The beautifully updated kitchen anchors the main living space, offering high-end finishes and a seamless flow into dining and gathering areasperfect for entertaining or quiet nights at home. Upstairs, the serene primary suite features a spa-inspired bath and a large, hotel-style walk-in closet. Three additional bedrooms and a dedicated office provide ample space for family, guests, or working from home. A detached garage with finished space above offers endless potentialthink studio, gym, office, playroom or guest suite. Whether relaxing on the patio, strolling around the ponds, or enjoying the sweeping grounds, this rare farmhouse property delivers privacy, beauty, and a sense of home that feels like a hidden gem."
    },
    {
        "Neighborhood": "Bedford",
        "Address": "108 Cherry St, Katonah, NY 10536",
        "Postal Code": "10536",
        "Price": "$995000",
        "Bedrooms": 3,
        "Bathrooms": 3,
        "House Size": "2008 sqft",
        "Lot Size": "87120 sqft",
        "Image": "https://ap.rdcpix.com/a2b52ae6961c61f834a305f7e9f3acbfl-m106121875s.jpg",
        "Description": "Nestled on serene 2-acres of level property in the heart of Katonah, this 3 bedroom, 2 1/2 bath home is the perfect blend of historic charm and modern updates while being just minutes from town and train. Inviting front porch, spacious living room with beamed ceilings, warm hardwood floors and fireplace, updated kitchen and a sun-filled family room offer plenty of space for family living and entertaining. Large first floor primary suite with updated bath and two additional bedrooms upstairs with a second renovated bath. The expansive deck overlooks the private backyard and is perfect for dining alfresco. Full house generator. Experience the perfect balance of privacy and accessibility in this charming Katonah home."
    },
    {
        "Neighborhood": "Bedford",
        "Address": "93 Huntville Rd, Katonah, NY 10536",
        "Postal Code": "10536",
        "Price": "$799000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1548 sqft",
        "Lot Size": "6395 sqft",
        "Image": "https://ap.rdcpix.com/5004b25b2358a7dc47dfc7927d80caddl-m3042719418s.jpg",
        "Description": "Katonah: Circa 1930 and located in a sought-after area this home offers a perfect blend of vintage character and modern comfort. As you enter through the enclosed foyer into an open living room area with fireplace, custom built-ins you experience a special feeling of a charming home. Pella windows flood the room with natural light along with wood flooring. The adjacent dining area and open kitchen with stainless appliances is a great space for family meals and an added bonus is the sliding glass door to an oversized trek deck perfect for alfresco dining, large gatherings and a great space for entertaining overlooking the bucolic private backyard. Access to a private patio is another peaceful outdoor area. The second level has a primary bedroom with ample closets, two additional bedrooms and hall bath complete this level. The walk-out lower level has multi-purpose uses along with a bathroom, laundry area, utility area and storage space. Located steps away from KES and sidewalks to Katonah Hamlet for fine dining, unique shops, amazing library and Katonah's Metro-North station for easy NYC and local commuting. Enjoy Bedford Recreation and all it has to offer. Award winning Katonah/Lewisboro Schools!"
    },
    {
        "Neighborhood": "Somers",
        "Address": "6 Timberlane Dr, Katonah, NY 10536",
        "Postal Code": "10536",
        "Price": "$839000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "3200 sqft",
        "Lot Size": "168142 sqft",
        "Image": "https://ap.rdcpix.com/ac138bcc70f6eacfb5ece4fdc96be068l-m812568488s.jpg",
        "Description": "Welcome to this charming Colonial home, situated on a quiet cul-de-sac. Originally built in 1996, this home offers comfort and space in a prime location. Step inside to find large, sunlit rooms with oversized windows that fill the interior with natural light. Hardwood floors flow throughout the home. The open-concept living room and kitchen create a warm, inviting space for gatherings and everyday living. The full basement offers versatile space for a recreation room, home office, gym, or guest suite, and features a walk-out screened-in porch that opens to a beautiful, private, and lush backyardperfect for relaxing with your morning coffee or entertaining during summer gatherings. The home will need some work, but it has solid potential for the right buyer to update and make it their own. This is a rare opportunity to own a bright and spacious home in a peaceful setting."
    },
    {
        "Neighborhood": "N/A",
        "Address": "336 Jay St, Katonah, NY 10536",
        "Postal Code": "10536",
        "Price": "$1150000",
        "Bedrooms": "N/A",
        "Bathrooms": "N/A",
        "House Size": "N/A sqft",
        "Lot Size": "N/A sqft",
        "Image": "https://ap.rdcpix.com/457c206df4f6c777374ef201ed5201ddl-w877493122s.jpg",
        "Description": "No description available."
    },
    {
        "Neighborhood": "East New York",
        "Address": "536 Georgia Ave, Brooklyn, NY 11207",
        "Postal Code": "11207",
        "Price": "$150000",
        "Bedrooms": 5,
        "Bathrooms": 2,
        "House Size": "2040 sqft",
        "Lot Size": "2614 sqft",
        "Image": "https://ap.rdcpix.com/671f25d4c84a980e349bb001ab143845l-m477604553s.jpg",
        "Description": "We are currently ONLY entertaining offers on our properties as we are inundated with interested parties.. Please do submit offers in writing via email. Please be sure to have the address and offer amount on the email Offers are reviewed by the selling party of the property and not the bank. This is NOT a REO. NOTE: We are contracted by the seller and do not advise regarding offers. Access is ONLY provided when an offer is accepted, buyers will be given a due diligence period in which they will have a chance to expedite a contract for submission to the bank where we will then require proof of funds and other documents the bank needs to expedite the shortsale. Due to investor/servicer guidelines, status of properties under short sale review cannot be changed from \"available\" to \"under contract\" if a contract has been signed. This property must be kept open to the public view. Please email our office with any inquiries."
    },
    {
        "Neighborhood": "Southwestern Brooklyn",
        "Address": "977 80th St, Brooklyn, NY 11228",
        "Postal Code": "11228",
        "Price": "$1250000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1135 sqft",
        "Lot Size": "2000 sqft",
        "Image": "https://ap.rdcpix.com/2ec6d03c70967b9847fb3d352272d217l-m3598645579s.jpg",
        "Description": "Stunning 1 family home in the heart of Dyker Heights. First floor features semi enclosed porch/foyer that leads right into your formal living room and formal dining room complete with beautiful parquet floors. Beautiful, bright and fully tiled EIK with granite countertops with direct access to your backyard. First floor also features .50 bath. Second floor features 3 bedrooms and full bath. Basement is fully finished with .75 bath and fully tiled. Ideal for a family room or recreation. Backyard features a shared drive with a 1 car garage."
    },
    {
        "Neighborhood": "Northwestern Brooklyn",
        "Address": "25 Grace Ct, Brooklyn, NY 11201",
        "Postal Code": "11201",
        "Price": "$16000000",
        "Bedrooms": 7,
        "Bathrooms": 5,
        "House Size": "5975 sqft",
        "Lot Size": "None sqft",
        "Image": "https://ap.rdcpix.com/10ad5724a76dcc01448c88838e718b28l-m3685326041s.jpg",
        "Description": "Architecturally Remarkable 30-Ft Wide Mansion in Brooklyn Heights Award-winning design featuring a home theater, private gym, multi-level backyard, and 6 fireplaces situated near the end of a secluded, one-block cul-de-sac street fronted by historic landmarks. 25 Grace Court is one of the most exclusive addresses in Brooklyn Heights. Built in the mid-to-late 1800s, this regal 5-level, 30-foot-wide townhome spans nearly 6, 000 square feet with 7 bedrooms, 4.5 bathrooms, and breathtaking architectural features throughout. Additional comforts include 6 fireplaces, central air, and custom built-in's and woodwork throughout. IMBUED WITH HISTORIC DETAILS The restored redbrick fa ade won the 2007 Lucy G. Moses Preservation Award and was part of a whole home renovation completed in the mid-2000s. Interiors showcase a collection of period details, including an elegant spiral staircase, arched double doors, Tiffany glass, inviting bay windows, beautiful hardwood floors with border inlays, and intricate crown molding, ceiling medallions, and fretwork transoms. Hardware and bathroom fixtures were sourced from P.E. Guerin. GRAND ENTERTAINING On the parlor level are formal living and dining rooms with 13-foot ceilings, wood-burning fireplaces, custom built-ins, and bay windows. The dining room boasts designer wallpaper from Gracie, a built-in wet bar, and access to a landscaped backyard patio for seamless indoor outdoor entertaining. Adjoining the dining room is a windowed galley kitchen featuring barrel vaulted ceilings, marble floors, an oculus, a breakfast nook, and high-end appliances from Viking and Sub-Zero. LUXURIOUS AMENITIES The garden level is a floor-through amenity space. The incredible home theater includes plush leather seating, blackout curtains, and motorized screen curtains, while the adjoining galley kitchen features with marble countertops, a farmhouse sink, and appliances from Sub-Zero and De'Longhi. Opposite the theater is a home gym that can easily be used as a guest suite or quarters for staff. Both the theater and gym have access to a pristine full bathroom. PRIVATE, SUN-SPLASHED BEDROOMS The second and third levels are dedicated bedroom floors with abundant natural light and three bedrooms each. The king-size primary suite overlooks the backyard and has a dressing room, two walk-in closets, and couples\" en-suite bathrooms. The bedrooms on the third level share access to an enormous windowed full bathroom with a step-in shower and freestanding soaking tub. A massive over 1, 400 sq ft windowed attic which also offers laundry room and provides ample storage. CHARMED CUL-DE-SAC LIVING Grace Court is one of the quietest and most private tree-lined streets in Brooklyn Heights. At the end of the cul-de-sac is a small garden with views of the New York Harbor, Brooklyn Bridge Park, the Statue of Liberty, and the Lower Manhattan Skyline. Exciting restaurants, cute cafes, and trendy bars are moments away, including Chama Mama, Dellarocco's, Sippy, About coffee, and more. Accessible public transportation includes local bus lines, the NYC Ferry, and the 2, 3, 4, 5, A, C, R, and F subway lines"
    },
    {
        "Neighborhood": "West Waverly",
        "Address": "494 E 96th St, Brooklyn, NY 11212",
        "Postal Code": "11212",
        "Price": "$500000",
        "Bedrooms": 16,
        "Bathrooms": 4,
        "House Size": "None sqft",
        "Lot Size": "None sqft",
        "Image": "https://ap.rdcpix.com/00bf0d99aff13732a0687258b6a1f73dl-m3092275580s.jpg",
        "Description": "Detach 4 family handyman short sale property subject to third party approval needs total renovation needs interior work, plumbing and electrical off of Church Ave close to Hospital and public transportation has lot of potential, Property has private driveway"
    }
]